app/controllers/homes_controller.rb

	def top
	   @styilings = Styiling.all.page(params[:page]).per(12).reverse_order
---
SELECT  "styilings".* FROM "styilings" ORDER BY "styilings"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 12], ["OFFSET", 0]]

	def top_info
	   @styilings = Styiling.all.page(params[:page]).per(12).reverse_order
---
SELECT  "styilings".* FROM "styilings" ORDER BY "styilings"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 12], ["OFFSET", 0]]