app/controllers/styilings_controller.rb

   def women_ranking
       @gender_ranks = Styiling.joins(:favorites).where(gender:"女性").group(:styiling_id).order('count(favorites.styiling_id) desc').limit(9)
---
SELECT  "styilings".* FROM "styilings" INNER JOIN "favorites" ON "favorites"."styiling_id" = "styilings"."id" WHERE "styilings"."gender" = ? GROUP BY "styiling_id" ORDER BY count(favorites.styiling_id) desc LIMIT ?  [["gender", "女性"], ["LIMIT", 9]]

    def men_ranking
       @gender_ranks = Styiling.joins(:favorites).where(gender:"男性").group(:styiling_id).order('count(favorites.styiling_id) desc').limit(9)
---
SELECT  "styilings".* FROM "styilings" INNER JOIN "favorites" ON "favorites"."styiling_id" = "styilings"."id" WHERE "styilings"."gender" = ? GROUP BY "styiling_id" ORDER BY count(favorites.styiling_id) desc LIMIT ?  [["gender", "男性"], ["LIMIT", 9]]

   def women_ranking_info
        @gender_ranks = Styiling.joins(:favorites).where(gender:"女性").group(:styiling_id).order('count(favorites.styiling_id) desc').limit(9)
---
SELECT  "styilings".* FROM "styilings" INNER JOIN "favorites" ON "favorites"."styiling_id" = "styilings"."id" WHERE "styilings"."gender" = ? GROUP BY "styiling_id" ORDER BY count(favorites.styiling_id) desc LIMIT ?  [["gender", "女性"], ["LIMIT", 9]]

    def men_ranking_info
        @gender_ranks = Styiling.joins(:favorites).where(gender:"男性").group(:styiling_id).order('count(favorites.styiling_id) desc').limit(9)
---
SELECT  "styilings".* FROM "styilings" INNER JOIN "favorites" ON "favorites"."styiling_id" = "styilings"."id" WHERE "styilings"."gender" = ? GROUP BY "styiling_id" ORDER BY count(favorites.styiling_id) desc LIMIT ?  [["gender", "男性"], ["LIMIT", 9]]

   def women_index
       @styilings = Styiling.where(gender:"女性").page(params[:page]).per(15).reverse_order
---
SELECT  "styilings".* FROM "styilings" WHERE "styilings"."gender" = ? ORDER BY "styilings"."id" DESC LIMIT ? OFFSET ?  [["gender", "女性"], ["LIMIT", 15], ["OFFSET", 0]]

   def women_index_info
       @styilings = Styiling.where(gender:"女性").page(params[:page]).per(15).reverse_order
---
SELECT  "styilings".* FROM "styilings" WHERE "styilings"."gender" = ? ORDER BY "styilings"."id" DESC LIMIT ? OFFSET ?  [["gender", "女性"], ["LIMIT", 15], ["OFFSET", 0]]

   def men_index
       @styilings = Styiling.where(gender:"男性").page(params[:page]).per(15).reverse_order
---
SELECT  "styilings".* FROM "styilings" WHERE "styilings"."gender" = ? ORDER BY "styilings"."id" DESC LIMIT ? OFFSET ?  [["gender", "男性"], ["LIMIT", 15], ["OFFSET", 0]]

   def men_index_info
       @styilings = Styiling.where(gender:"男性").page(params[:page]).per(15).reverse_order
---
SELECT  "styilings".* FROM "styilings" WHERE "styilings"."gender" = ? ORDER BY "styilings"."id" DESC LIMIT ? OFFSET ?  [["gender", "男性"], ["LIMIT", 15], ["OFFSET", 0]]

   def index_list
       @styilings = Styiling.all.page(params[:page]).per(15).reverse_order
---
SELECT  "styilings".* FROM "styilings" ORDER BY "styilings"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]