app/controllers/users_controller.rb

    def women_index
    	@users = User.where(gender:"女性").page(params[:page]).per(20).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."gender" = ? ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["gender", "女性"], ["LIMIT", 20], ["OFFSET", 0]]

    def women_index_info
    	@users = User.where(gender:"女性").page(params[:page]).per(20).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."gender" = ? ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["gender", "女性"], ["LIMIT", 20], ["OFFSET", 0]]

    def men_index
    	@users = User.where(gender:"男性").page(params[:page]).per(20).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."gender" = ? ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["gender", "男性"], ["LIMIT", 20], ["OFFSET", 0]]

     def men_index_info
    	@users = User.where(gender:"男性").page(params[:page]).per(20).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."gender" = ? ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["gender", "男性"], ["LIMIT", 20], ["OFFSET", 0]]

	def index_info
		@users = User.all.page(params[:page]).per(20).reverse_order
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]

	def index
		@users = User.all.page(params[:page]).per(20).reverse_order
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]